
tap "armmbed/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

#<------- BREW -------->
# Unix core utilities
brew "coreutils"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Cross-platform make
brew "cmake"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Programming language for highly scalable real-time systems
brew "erlang"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Object-relational database system
brew "postgresql@14"
# Messaging broker
brew "rabbitmq"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Simplified and community-driven man pages
brew "tldr"
# Internet file retriever
brew "wget"
# Arm compiler for Raspberry Pico C/C++ sdk
brew "armmbed/formulae/arm-none-eabi-gcc"

#<-------- CASKS ------------> 
# Warp terminal 
cask "warp"
# Docker desktop
cask "docker"
# Brave browser
cask "brave-browser"
# Statistical analysis application
cask "jasp"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Visual studio code and extensions
cask "visual-studio-code"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "hediet.vscode-drawio"
vscode "janisdd.vscode-edit-csv"
vscode "jasonnutter.search-node-modules"
vscode "josetr.cmake-language-support-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-fr"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.vscode-serial-monitor"
vscode "octref.vetur"
vscode "orhun.black-waves"
vscode "Pycom.pymakr"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl"
vscode "svelte.svelte-vscode"
vscode "tarik02.absolutely-black"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vsciot-vscode.vscode-arduino"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "xabikos.JavaScriptSnippets"
vscode "yzhang.markdown-all-in-one"
